<!-- dflook/terraform-github-actions {"workspace":"dev-dev-deploy","backend_type":"remote","backend":"0dd52039d936a7e1d5025a8a4d08a2edb19c1f8a40406c06dd09dde4084f97a6","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #49 at https://github.com/scidsg/hushline/actions/runs/9720876211","plan_out_hash":"e228189550d3e2b189fd4ebf3d3df0fc997978bd4e394777db66ab06ce0e7391","plan_hash":"11735327046b9162114a48aae95295836e20d5708d023ae2aef5713523c87176","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __dev-dev-deploy__ workspace<details open><summary>With variables</summary>

```hcl
name = "hushline-dev-deploy"
tag  = "latest"
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.digitalocean_app.app must be replaced
-/+ resource "digitalocean_app" "app" {
!~      active_deployment_id = "************************************" -> (known after apply)
!~      created_at           = "2024-06-29 02:22:38 +0000 UTC" -> (known after apply)
!~      default_ingress      = "https://hushline-dev-deploy-u7gcy.ondigitalocean.app" -> (known after apply)
!~      id                   = "************************************" -> (known after apply)
!~      live_url             = "https://hushline-dev-deploy-u7gcy.ondigitalocean.app" -> (known after apply)
!~      project_id           = "f73fb903-cb9c-4ba2-b651-c406d1887321" -> "c5f3ef59-0f8f-4193-b7e2-e850644c43bf" # forces replacement
!~      updated_at           = "2024-06-29 02:23:40 +0000 UTC" -> (known after apply)
!~      urn                  = "do:app:b251b15f-ec34-480f-b608-72b3d1f93291" -> (known after apply)

!~      dedicated_ips {
+           active_deployment_id = (known after apply)
+           created_at           = (known after apply)
+           default_ingress      = (known after apply)
+           id                   = (known after apply)
+           live_url             = (known after apply)
+           project_id           = (known after apply)
+           updated_at           = (known after apply)
+           urn                  = (known after apply)
        } -> (known after apply)

!~      spec {
!~          domains  = [] -> (known after apply)
-           features = [
-               "buildpack-stack=ubuntu-22",
            ] -> null
            name     = "hushline-dev-deploy"
#            (1 unchanged attribute hidden)

!~          domain {
+               domains  = (known after apply)
+               features = (known after apply)
+               name     = (known after apply)
+               region   = (known after apply)
            } -> (known after apply)

!~          ingress {
+               domains  = (known after apply)
+               features = (known after apply)
+               name     = (known after apply)
+               region   = (known after apply)
            } -> (known after apply)

!~          service {
!~              internal_ports     = [] -> (known after apply)
                name               = "hushline"
+               run_command        = (known after apply)
#                (7 unchanged attributes hidden)

!~              health_check {
-                   failure_threshold     = 0 -> null
-                   initial_delay_seconds = 0 -> null
-                   period_seconds        = 0 -> null
-                   port                  = 0 -> null
-                   success_threshold     = 0 -> null
-                   timeout_seconds       = 0 -> null
#                    (1 unchanged attribute hidden)
                }

!~              image {
-                   registry_credentials = (sensitive value) -> null
#                    (4 unchanged attributes hidden)

!~                  deploy_on_push {
+                       registry             = (known after apply)
+                       registry_credentials = (known after apply)
+                       registry_type        = (known after apply)
+                       repository           = (known after apply)
+                       tag                  = (known after apply)
                    } -> (known after apply)
                }

!~              routes {
+                   build_command      = (known after apply)
+                   dockerfile_path    = (known after apply)
+                   environment_slug   = (known after apply)
+                   http_port          = (known after apply)
+                   instance_count     = (known after apply)
+                   instance_size_slug = (known after apply)
+                   internal_ports     = (known after apply)
+                   name               = (known after apply)
+                   run_command        = (known after apply)
+                   source_dir         = (known after apply)
                } -> (known after apply)
            }

#            (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #49](https://github.com/scidsg/hushline/actions/runs/9720876211)